src/python/toolchain/payments/stripe_integration/test_utils/fixtures/price_search_response.json

{
  "object": "search_result",
  "data": [
    {
      "id": "price_1KvnUvEfbv3GSgSdPOLuyFxJ",
      "object": "price",
      "active": true,
      "billing_scheme": "per_unit",
      "created": 1651691069,
      "currency": "usd",
      "custom_unit_amount": null,
      "livemode": false,
      "lookup_key": null,
      "metadata": {},
      "nickname": "Jackie Chiles",
      "product": "prod_LcgVoYRbtZeS7i",
      "recurring": {
        "aggregate_usage": null,
        "interval": "year",
        "interval_count": 1,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "tax_behavior": "unspecified",
      "tiers_mode": null,
      "transform_quantity": null,
      "type": "recurring",
      "unit_amount": 20000,
      "unit_amount_decimal": "20000"
    },
    {
      "id": "price_no_bagel_no_bagel_no_bagel",
      "object": "price",
      "active": true,
      "billing_scheme": "per_unit",
      "created": 1651605105,
      "currency": "usd",
      "custom_unit_amount": null,
      "livemode": false,
      "lookup_key": null,
      "metadata": {},
      "nickname": "Cinnamon Babka",
      "product": "prod_LcgVoYRbtZeS7i",
      "recurring": {
        "aggregate_usage": null,
        "interval": "month",
        "interval_count": 1,
        "trial_period_days": 20,
        "usage_type": "licensed"
      },
      "tax_behavior": "unspecified",
      "tiers_mode": null,
      "transform_quantity": null,
      "type": "recurring",
      "unit_amount": 2000,
      "unit_amount_decimal": "2000"
    }
  ],
  "has_more": false,
  "next_page": null,
  "url": "/v1/prices/search"
}